#+BEGIN_COMMENT
.. title: PySpark Set-Up and Integration with Emacs
.. slug: pyspark-set-up
.. date: 2019-08-05 23:51:11 UTC+02:00
.. tags: Big Data, Spark, emacs
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+BEGIN_HTML
<br>
<br>
#+END_HTML

This post aims at providing an overview of the necessary steps
required in order to leverage Apache Spark through the Python API and
the PySpark module.

Despite the information is vastly reported over the internet my usual
/procedere/ when I deal with new tools and software is to write a
short piece of note when learning new software that is intended as an
overview over the tool and serve as a beginner cheat sheet.

{{{TEASER_END}}}

*** PySpark on Jupyter Notebook and Emacs Integration
 :PROPERTIES:
 :header-args:ipython: :session kernel-6455.json :results output
 :END:

In order to start and connect to pyspark on your local machine it will
then just be necessary to start an ipython kernel by running

#+BEGIN_EXAMPLE
$ ipython kernel
#+END_EXAMPLE

This will prompt the name of a /.json/ file that contains the
information (port, connection protocol etc.) to connect to the kernel
in a similar way to the following message:

#+BEGIN_QUOTE
To connect another client to this kernel, use:
    --existing kernel-5060.json
#+END_QUOTE

You can then specify your kernel.json as your session argument in
=ob-ipython= and connect to the running kernel. At this point after
installing findspark via

#+BEGIN_EXAMPLE
$ pip3 install --user findspark
#+END_EXAMPLE

you are good to import your pyspark module and leverage the Pyspark
API on your favourite editor: /emacs/

#+begin_src ipython :exports both
  import findspark
  findspark.init()
  import pyspark
  import random
  sc = pyspark.SparkContext(appName="Pi")
  num_samples = 100000000
  def inside(p):     
    x, y = random.random(), random.random()
    return x*x + y*y < 1
  count = sc.parallelize(range(0, num_samples)).filter(inside).count()
  pi = 4 * count / num_samples
  print (pi)
  sc.stop()
#+end_src

#+RESULTS:
: 3.14109952

In the case you will want to leverage a more powerful machine and run
your pyspark application on a server you might follow the logic
explained in the following post keeping the structure outlined in the
post. [[https://necromuralist.github.io/posts/programming/remote-jupyter-sessions-with-ob-ipython/][Connect to remote ipython kernel.]]
